export default {
    通用_管理器_文本: '插件管理器',
    通用_成功_文本: '成功',
    通用_失败_文本: '失败',
    通用_新增_文本: '新增',
    通用_操作_文本: '操作',
    通用_搜索_文本: '搜索',
    通用_名称_文本: '名称',

    管理器_GITHUB_描述: '访问作者的GitHub页面，查看项目详情、更新日志、参与讨论和贡献代码。',
    管理器_编辑模式_描述: '启用编辑模式，允许对插件的配置进行更深入的自定义和调整。',
    管理器_重载插件_描述: '重新加载所有插件，使更改立即生效而无需重启Obsidian。',
    管理器_检查更新_描述: '检查插件是否有可用的更新，保持插件最新以获得最佳体验。',
    管理器_一键禁用_描述: '一键禁用插件，帮助你快速重置插件设置或解决性能问题。',
    管理器_一键启用_描述: '一键启用插件，快速恢复到默认的插件启用状态。',
    管理器_插件设置_描述: '管理插件的设置，调整功能和行为以满足个人需求。',
    管理器_仅启用_描述: '仅显示当前已启用的插件，快速管理和调整启用状态。',
    管理器_打开设置_描述: '打开插件的设置界面，在这里你可以调整插件管理的相关选项和偏好设置。',
    管理器_还原内容_描述: '将插件展示内容还原到初始状态，撤销所有之前的更改，恢复到默认配置。',
    管理器_打开目录_描述: '打开包含所有插件文件的目录，方便你进行手动检查、编辑或备份插件文件。',
    管理器_删除插件_描述: '从你的系统中彻底删除选定的插件，包括其所有文件和设置。请谨慎操作，因为此操作不可撤销。',
    管理器_切换状态_描述: '切换插件的启用或禁用状态。点击启用以运行插件，点击禁用以停止插件功能，而不删除插件。',

    卸载_标题: '卸载插件',
    卸载_提示: '你确定要卸载此插件吗？这将删除插件的文件夹。',
    卸载_卸载: '卸载',
    卸载_取消: '取消',

    设置_基础设置_前缀: '基础',
    设置_分组设置_前缀: '分组',
    设置_标签设置_前缀: '标签',
    设置_延迟设置_前缀: '延迟',

    设置_基础设置_样式_标题: '样式',
    设置_基础设置_目录样式_标题: '目录样式',
    设置_基础设置_目录样式_描述: '选择分组的样式，以提升浏览体验。',
    设置_基础设置_分组样式_标题: '分组样式',
    设置_基础设置_分组样式_描述: '选择分组的样式，使分组更加明显，便于识别。',
    设置_基础设置_标签样式_标题: '标签样式',
    设置_基础设置_标签样式_描述: '选择标签的样式，使标签更加明显，便于识别。',

    设置_基础设置_功能_标题: '功能',
    设置_基础设置_淡化插件_标题: '淡化插件',
    设置_基础设置_淡化插件_描述: '为未启用的插件提供视觉淡化效果，以便清晰地区分启用和未启用的插件。',

    设置_延迟设置_通知_一: '[延迟] 已添加',
    设置_延迟设置_通知_二: '[延迟] ID已存在或为空',
    设置_延迟设置_通知_三: '[延迟] 删除成功',
    设置_延迟设置_通知_四: '[延迟] 删除失败，此延迟下存在插件',

    设置_分组设置_通知_一: '[分组] 已添加',
    设置_分组设置_通知_二: '[分组] ID已存在或为空',
    设置_分组设置_通知_三: '[分组] 删除成功',
    设置_分组设置_通知_四: '[分组] 删除失败，此分组下存在插件',

    设置_标签设置_通知_一: '[标签] 已添加',
    设置_标签设置_通知_二: '[标签] ID已存在或为空',
    设置_标签设置_通知_三: '[标签] 删除成功',
    设置_标签设置_通知_四: '[标签] 删除失败，此标签下存在插件',


    命令_管理面板_描述: '开启插件管理器',
}